docs/spec/html/storage-ops.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000005">1. Storage Ops（SQLite運用）仕様（MVP）</a>
<ul>
<li><a href="#org0000000">1.1. DBパス</a></li>
<li><a href="#org0000001">1.2. 初期化</a></li>
<li><a href="#org0000002">1.3. マイグレーション（MVP方針）</a></li>
<li><a href="#org0000003">1.4. バックアップ（MVP方針）</a></li>
<li><a href="#org0000004">1.5. article_text（容量）について</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0000005" class="outline-2">
<h2 id="org0000005"><span class="section-number-2">1.</span> Storage Ops（SQLite運用）仕様（MVP）</h2>
<div class="outline-text-2" id="text-1">
<p>
このドキュメントは、SQLite DBの作成/初期化/バックアップ/移行の運用指針を定義する。
</p>
</div>

<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> DBパス</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>既定: `~/.local/share/content-stager/content-stager.sqlite3`</li>
<li>`~/.local/share/content-stager/` が無い場合は自動作成する（decisions.org参照）</li>
</ul>
</div>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.2.</span> 初期化</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>DBファイルが存在しない場合:
<ul class="org-ul">
<li>作成し、`spec/data-model.org` のDDLを適用する</li>
</ul></li>
<li>既存DBがある場合:
<ul class="org-ul">
<li>DDLの自動再適用ではなく、マイグレーションで更新する</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.3.</span> マイグレーション（MVP方針）</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>MVPでは、まずは手動マイグレーション（SQLファイルの順次適用）で運用する（assumed）。</li>
<li>推奨:
<ul class="org-ul">
<li>`schema_migrations` テーブルを用意し、適用済みIDを記録する（実装計画で確定）。</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">1.4.</span> バックアップ（MVP方針）</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>最低限:
<ul class="org-ul">
<li>DBファイルのコピー（アプリ停止中）</li>
</ul></li>
<li>推奨:
<ul class="org-ul">
<li>`sqlite3` の `.backup` を利用（実装計画で確定）</li>
</ul></li>
<li>目的:
<ul class="org-ul">
<li>破損時の復旧</li>
<li>将来のスキーマ変更に備える</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0000004" class="outline-3">
<h3 id="org0000004"><span class="section-number-3">1.5.</span> article_text（容量）について</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>MVPでは全文を保存する（decisions.org参照）</li>
<li>サイズ上限/圧縮/保持期間は未確定（open-questions.org参照）</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
